#!/usr/bin/env node

import fs from "fs";
import path from "path";
import { fileURLToPath } from "url";
import { execSync } from "child_process";

const __filename = fileURLToPath(import.meta.url);
const __dirname = path.dirname(__filename);

const projectName = process.argv[2] || "amin-dashboard";

console.log("🚀 Creating:", projectName);

const templatePath = path.resolve(__dirname, "template");

console.log("🔎 CLI location:", __dirname);
console.log("📁 Template path:", templatePath);

if (!fs.existsSync(templatePath)) {
    console.error("❌ Template folder not found:", templatePath);
    process.exit(1);
}

fs.cpSync(templatePath, projectName, { recursive: true });

console.log("📦 Installing dependencies...");

execSync("npm install", {
    cwd: projectName,
    stdio: "inherit",
});


/* ---------------- Final Output ---------------- */
console.log(`
 █████╗ ███╗   ███╗██╗███╗   ██╗
██╔══██╗████╗ ████║██║████╗  ██║
███████║██╔████╔██║██║██╔██╗ ██║
██╔══██║██║╚██╔╝██║██║██║╚██╗██║
██║  ██║██║ ╚═╝ ██║██║██║ ╚████║
╚═╝  ╚═╝╚═╝     ╚═╝╚═╝╚═╝  ╚═══╝

 ██████╗  █████╗ ███████╗██╗  ██╗██████╗  ██████╗  █████╗ ██████╗ ██████╗ 
 ██╔══██╗██╔══██╗██╔════╝██║  ██║██╔══██╗██╔═══██╗██╔══██╗██╔══██╗██╔══██╗
 ██║  ██║███████║███████╗███████║██████╔╝██║   ██║███████║██████╔╝██║  ██║
 ██║  ██║██╔══██║╚════██║██╔══██║██╔══██╗██║   ██║██╔══██║██╔══██╗██║  ██║
 ██████╔╝██║  ██║███████║██║  ██║██████╔╝╚██████╔╝██║  ██║██║  ██║██████╔╝
 ╚═════╝ ╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝╚═════╝  ╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═╝╚═════╝ 

 🚀 AMIN DASHBOARD
 ─────────────────────────────────────────
 ✔ Application booted successfully
 ✔ Routes registered
 ✔ Components loaded
 ✔ Environment ready

 🌐 Framework : React
 🎨 UI        : Tailwind CSS
 🧭 Router    : React Router
 ⚙️  Mode      : Development

 Happy coding ! 💙👍
`);

console.log(`cd ${projectName}`);
console.log("npm run dev");